#include <stdio.h>

/**
 * @author 张寅森
 */

int main(int argc, char* argv[]) {
	printf("这次的假期学习是我第一次进行如此高度集中的OI的学习，也有不少收获。\n");
	printf("之前一直没弄懂的一些DP模型、图论的基本知识，等之前所欠缺的内容，在这次的学习中都有所补充。\n");
	printf("中途还有一次因为机缘巧合，我恰好找到了一道题的答案，直接复制了提交上去，被老师发现并扣分，也让我再次意识到这是一场严肃的比赛。\n");
	printf("我也认识了不少外校的NOIP同胞们，让我意识到这是一个大团体，而不仅仅是之前在成外认识的那十多个同学。\n");
	printf("我自己也发现了自己许多不尽人意的地方，除了智商之外我还非常粗心，之前一道大水题我由于输出忘记换行而导致全爆，此类失误一共使我丢失两百多分，错了四五道题。\n");
	printf("还有一些关于编译器的问题，我自己的PC的DEV C++是5.11的，和机房的不一样，以至于minGW32中的abs()就在我只include了math.h的情况下依旧通过了编译并运行良好。\n");
	printf("事实上，那道题（就是昨天的第一题）我也是水到了四分的，只不过就因为编译器的原因导致我编译不通过，最后一场空。\n");
	printf("而在平时的上课中我也意识到了语言层面的知识点的重要性，比如之前我一直为同学所鄙视的对于malloc函数和free函数的使用，这次我也看到熊老师在字典树中使用它。这就说明了解这些函数也是很重要的。\n");
	printf("数据类型上，我本来也只会在BFS中使用queue，后来我也知道了stack、vector等数据类型的用法，也了解了他们的优劣。\n");
	printf("在自己能力范围之外的题，我也学会了输出适当的结果以获取(pian)部分(fen)分数，这些看似歪门邪道，实际在OI中却是非常重要的技能。\n");
	printf("同学们AK的光荣事迹也时刻警醒着我对手的强大，给我十足的压力。比如杨宗翰同学时常的叫嚣。\n");
	printf("中间我也有电脑内存报警并代码急救失败的情况，也让我意识到了人品的重要性。\n");
	printf("\n");
	printf("我不会退出这场比赛，因此我把成功退出的代码注释掉了。\n");
//	return 0;
}
